package NeoflexHoomework.src.ru.neoflex.homework.OOP;

public class Task {

//2.      Реализовать иерархию классов геометрических фигур в плоской системе координат – точка, прямая, окружность,
// треугольник, квадрат, прямоугольник, параллелограмм.
//    Каждая сущность должна задаваться минимально необходимым количеством параметров и иметь методы, возвращающие её
//    параметры – тип фигуры, длина линий, из которых она состоит (для точки константа 0, для прямой – длина, для окружности
//    – длина окружности, для остальных периметр), площадь (для точки и прямой константа 0). Необходимо создать коллекцию
//    (массив) разных фигур и в цикле вывести в консоль их параметры.
//
//            3.      Разработать собственный класс, который можно использовать как перечисление.
}
